# Занятие 4: Условные операторы и циклы в Python


## Условные конструкции в Python

### Обзор и объяснение

- **Конструкция `if`**
  - Выполняет блок кода, если условие истинно.
  - Синтаксис:
    ```python
    if условие:
        # действия
    ```

- **Конструкция `elif`**
  - Выполняет блок кода, если предыдущее условие ложно, а текущее условие истинно.
  - Синтаксис:
    ```python
    if условие1:
        # действия, если условие1 истинно
    elif условие2:
        # действия, если условие1 ложно и условие2 истинно
    ```

- **Конструкция `else`**
  - Выполняет блок кода, если все предыдущие условия ложны.
  - Синтаксис:
    ```python
    if условие1:
        # действия, если условие1 истинно
    elif условие2:
        # действия, если условие1 ложно и условие2 истинно
    else:
        # действия, если все предыдущие условия ложны
    ```

**Пример:**

```python
age = int(input("Введите ваш возраст: "))
if age < 18:
    print("Вы несовершеннолетний.")
elif age == 18:
    print("Вы только что стали совершеннолетним.")
else:
    print("Вы совершеннолетний.")
```

### Best Practice

- **Используйте явные условия:** Формулируйте условия ясно и понятно. Пример `if age < 18` более очевиден, чем сложные логические выражения.
- **Минимизируйте вложенность:** Используйте `elif` и `else` для упрощения структуры кода и улучшения читаемости.
- **Четко обрабатывайте все случаи:** Убедитесь, что все возможные варианты условий охвачены, чтобы избежать неожиданного поведения.

## Циклы в Python

### Цикл `for`
---

- **Общее использование**
  - Итерация по последовательности (списки, строки, диапазоны).
  - Синтаксис:
    ```python
    for элемент in последовательность:
        # действия
    ```

- **Использование функции `range()`**
  - Генерация числовых последовательностей.
  - Синтаксис:
    ```python
    for i in range(start, stop, step):
        # действия
    ```

- **Использование `random.randint()`**
  - Генерация случайных чисел.
  - Импорт модуля `random`:
    ```python
    import random
    ```
  - Генерация случайного числа:
    ```python
    случайное_число = random.randint(нижняя_граница, верхняя_граница)
    ```

**Примеры:**

- Пример цикла `for` с `range()`:
  ```python
  for i in range(5):
      print(i)
  ```

- Пример использования `random.randint()` в цикле `for`:
  ```python
  import random
  for i in range(5):
      print(random.randint(1, 10))
  ```

### Цикл `while`
---

- **Общее использование**
  - Выполняет блок кода, пока условие истинно.
  - Синтаксис:
    ```python
    while условие:
        # действия
    ```

**Пример:**

```python
i = 0
while i < 5:
    print(i)
    i += 1
```

### Best Practice
---

- **Старайтесь избегать бесконечных циклов:** Убедитесь, что условие цикла изменяется и цикл имеет чёткое завершение.
- **Используйте правильные условия:** Не создавайте условия, которые сложно понять и поддерживать. Например, используйте `while i < 5` вместо более сложных выражений.
- **Оптимизируйте использование циклов:** По возможности избегайте вложенных циклов, если можно решить задачу более эффективным способом.


## Задачи для закрепления материала
**Задача 1: Игра "Угадай число"**
   - Написать программу, в которой компьютер загадывает число от 1 до 100, а пользователь должен угадать это число. Программа должна подсказывать, больше или меньше введённое число по сравнению с загаданным.

**Задача 2: Генератор пароля**
   - Написать программу, которая генерирует случайный пароль длиной 8 символов, содержащий буквы и цифры. Использовать циклы для создания пароля.